@yupwei68 Thanks for trying to reproduce this!   Your steps look correct to me.  The main differences I'm seeing are:
1) I was using MySQL version 8.0 ;
2) My resource group name was mixed case.

I'll include my before and after state for this so you can see what happened:

State before step 4:
`# azurerm_mysql_server.appian_db_01-repl[0] will be updated in-place
  ~ resource "azurerm_mysql_server" "appian_db_01-repl" {
        administrator_login               = "<username>"
        auto_grow_enabled                 = true
        backup_retention_days             = 7
      ~ create_mode                       = "Default" -> "Replica"
      + creation_source_server_id         = "/subscriptions/<subscription_id>/resourceGroups/rg_RASA_APPIAN_STG/providers/Microsoft.DBforMySQL/servers/appian-stg-db-01"
        fqdn                              = "appian-stg-db-01-repl.mysql.database.azure.com"
        geo_redundant_backup_enabled      = true
        id                                = "/subscriptions/<subscription_id>/resourceGroups/rg_RASA_APPIAN_STG/providers/Microsoft.DBforMySQL/servers/appian-stg-db-01-repl"
        infrastructure_encryption_enabled = false
        location                          = "canadaeast"
        name                              = "appian-stg-db-01-repl"
        public_network_access_enabled     = false
        resource_group_name               = "rg_RASA_APPIAN_STG"
        sku_name                          = "GP_Gen5_4"
        ssl_enforcement                   = "Enabled"
        ssl_enforcement_enabled           = true
        ssl_minimal_tls_version_enforced  = "TLSEnforcementDisabled"
        storage_mb                        = 131072
        version                           = "8.0"

        storage_profile {
            auto_grow             = "Enabled"
            backup_retention_days = 7
            geo_redundant_backup  = "Enabled"
            storage_mb            = 131072
        }

        timeouts {}
    }
`

And then at step 6:
`  # azurerm_mysql_server.appian_db_01-repl[0] must be replaced
-/+ resource "azurerm_mysql_server" "appian_db_01-repl" {
        administrator_login               = "<username>"
      + administrator_login_password      = (sensitive value)
        auto_grow_enabled                 = true
        backup_retention_days             = 7
        create_mode                       = "Replica"
        creation_source_server_id         = "/subscriptions/<subscription_id>/resourceGroups/rg_RASA_APPIAN_STG/providers/Microsoft.DBforMySQL/servers/appian-stg-db-01"
      ~ fqdn                              = "appian-stg-db-01-repl.mysql.database.azure.com" -> (known after apply)
        geo_redundant_backup_enabled      = true
      ~ id                                = "/subscriptions/<subscription_id>/resourceGroups/rg_rasa_appian_stg/providers/Microsoft.DBforMySQL/servers/appian-stg-db-01-repl" -> (known after apply)
        infrastructure_encryption_enabled = false
        location                          = "canadaeast"
        name                              = "appian-stg-db-01-repl"
        public_network_access_enabled     = false
      ~ resource_group_name               = "rg_rasa_appian_stg" -> "rg_RASA_APPIAN_STG" # forces replacement
        sku_name                          = "GP_Gen5_4"
      ~ ssl_enforcement                   = "Enabled" -> (known after apply)
        ssl_enforcement_enabled           = true
        ssl_minimal_tls_version_enforced  = "TLSEnforcementDisabled"
        storage_mb                        = 131072
        version                           = "8.0"

      ~ storage_profile {
          ~ auto_grow             = "Enabled" -> (known after apply)
          ~ backup_retention_days = 7 -> (known after apply)
          ~ geo_redundant_backup  = "Enabled" -> (known after apply)
          ~ storage_mb            = 131072 -> (known after apply)
        }

      - timeouts {}
    }

Plan: 1 to add, 0 to change, 1 to destroy.
`

So Terraform or something upstream seems to be changing the resource group name twice:  once when `create_mode` is changed from 'Default' to 'Replica', when the resource group is changed from mixed case to lowercase, and then again at step 6 when Terraform tries to reapply my original resource group name (converting back to mixed case from lowercase).

Ideally nothing should be altering the resource group name at step 4, then I would not be having this problem.

Thanks again :)